{
    "file": {
        "manual_trigger": "na",
        "exclude_openapi": false,
        "bucket": "demography",
        "file_name": "births",
        "category": "DEMOGRAPHY",
        "category_en": "Demography",
        "category_bm": "Demografi",
        "subcategory": "BIRTH_DEATH",
        "subcategory_en": "Births & Deaths",
        "subcategory_bm": "Kelahiran & Kematian",
        "description": {
            "en": "This dataset tabulates the number of people born in Malaysia and registered with JPN from 1920 to the present.",
            "bm": "Set data ini menunjukkan jumlah orang yang lahir di Malaysia dan didaftarkan dengan JPN daripada 1920 sehingga kini."
        },
        "link_parquet": "https://storage.data.gov.my/demography/births.parquet",
        "link_csv": "https://storage.data.gov.my/demography/births.csv",
        "link_preview": "https://storage.data.gov.my/demography/births.parquet",
        "variables": [
            {
                "id": -1,
                "name": "date",
                "title_en": "Date of Birth",
                "title_bm": "Tarikh Kelahiran",
                "desc_en": "[Date] Date of birth in YYYY-MM-DD format; note that this date represents the actual date of birth and NOT the date of registration with JPN",
                "desc_bm": "[Tarikh] Tarikh lahir dalam format YYYY-MM-DD; perlu ditekankan bahawa tarikh ini merujuk kepada tarikh kelahiran sebenar dan BUKAN tarikh pendaftaran dengan JPN"
            },
            {
                "id": -1,
                "name": "state",
                "title_en": "State",
                "title_bm": "Negeri",
                "desc_en": "[Categorical] Name of the state, with only Malaysia included for now",
                "desc_bm": "[Kategori] Name negeri, namun hanya data untuk Malaysia disediakan buat masa ini"
            },
            {
                "id": 1,
                "name": "births",
                "title_en": "Births",
                "title_bm": "Kelahiran",
                "desc_en": "[Integer] Number of births for the date",
                "desc_bm": "[Integer] Jumlah kelahiran pada tarikh tersebut",
                "catalog_data": {
                    "catalog_filters": {
                        "frequency": "DAILY",
                        "limit_frequency": false,
                        "geography": [
                            "NATIONAL"
                        ],
                        "demography": [],
                        "start": "1920",
                        "end": "2023",
                        "data_source": [
                            "JPN"
                        ]
                    },
                    "metadata_neutral": {
                        "data_as_of": "2023-07-31 23:59",
                        "last_updated": "2023-09-09 08:00",
                        "next_update": "2023-10-09 08:00"
                    },
                    "metadata_lang": {
                        "en": {
                            "methodology": "This dataset tabulates the number of people born in Malaysia and registered with JPN from 1920 to the present.",
                            "caveat": "There are several nuances to bear in mind when using this data:\n 1. The data is derived based on births registerd with JPN. Accordingly, if a birth is not registered with JPN (for instance, if a foreigner chooses to register their child in their home country, or if a resident in a remote area does not register the birth of their child), it will not count in this dataset.\n 2. This dataset tabulate births for each day of birth, rather than the date of registration with JPN. Therefore, to ensure accuracy, the data is provided with a 1 month lag, since most people do not register their child on the exact day they are born.\n 3. Data for past dates may be revised in future updates; this represents people registering children outside a 1 month window from their date of birth. However, our update procedure should ensure that there is no significant change to the trend. ",
                            "publication": "data.gov.my features a dashboard on [Birthday Popularity](https://data.gov.my/dashboard/birthday-explorer) where you can explore this dataset in a more interactive way!"
                        },
                        "bm": {
                            "methodology": "Set data ini menunjukkan jumlah orang yang lahir di Malaysia dan didaftarkan dengan JPN daripada 1920 sehingga kini.",
                            "caveat": "Terdapat beberapa nuansa yang perlu diambilkira semasa menggunakan data ini.\n 1. Data ini dihasilkan berdasarkan kelahiran yang didaftarkan dengan JPN. Oleh itu, sekiranya kelahiran itu tidak didaftarkan dengan JPN (contohnya sekiranya rakyat asing hanya mendaftar kelahiran anaknya di negara asal, ataupun penduduk di kawasan yang sangat terpencil belum mendaftarkan anaknya) maka ia tidak terkandung dalam set data ini.\n 2. Set data ini memaparkan jumlah kelahiran berdasarkan tarikh lahir dan bukannya tarikh pendaftaran dengan JPN. Oleh itu, bagi memastikan ketepatan data, set data ini dibekalkan dengan lag 1 bulan, memandankan kebayankan orang tidak mendaftarkan anak mereka sejurus mereka dilahirkan.\n 3. Data bagi tarikh-tarikh lepas mungkin akan dikemaskini pada masa depan; ini menunjukkan orang mendaftarkan anak mereka di luar tempoh 1 bulan daripada tarikh kelahiran. Namun, piawaian kemaskini kami biasanya akan memastikan tiada perubahan signifikan pada tren.",
                            "publication": "data.gov.my sendiri menyediakan papan pemuka tentang [Populariti Tarikh Lahir](https://data.gov.my/dashboard/birthday-explorer) yang membolehkan anda menerokai set data ini dengan lebih interaktif!"
                        }
                    },
                    "chart": {
                        "chart_type": "TIMESERIES",
                        "chart_filters": {
                            "SLICE_BY": [],
                            "precision": 0
                        },
                        "chart_variables": {
                            "parents": [],
                            "operation": "SUM",
                            "format": {
                                "x": "date",
                                "y": [
                                    "births"
                                ]
                            }
                        }
                    },
                    "translations": {
                        "en": {
                            "x": "Date",
                            "y1": "Births"
                        },
                        "bm": {
                            "x": "Tarikh",
                            "y1": "Kelahiran"
                        }
                    }
                }
            }
        ]
    }
}