{
    "link_csv": "https://storage.data.gov.my/dev/aadk_sex2.csv",
    "link_parquet": "https://storage.data.gov.my/dev/aadk_sex2.parquet",
    "link_preview": "https://storage.data.gov.my/dev/aadk_sex2.parquet",
    "title_en": "Drug Addicts by Sex in Malaysia (2015-2023)",
    "title_ms": "Penagih Dadah Mengikut Jantina di Malaysia (2015-2023)",
    "description_en": "This dataset provides the number of drug addicts in Malaysia categorized by state and gender from 2015 to 2023. The dataset describes drug addiction by gender in each state in Malaysia.",
    "description_ms": "Dataset ini menyediakan bilangan penagih dadah di Malaysia dan dikategorikan mengikut negeri dan jantina bagi tahun 2015 hingga 2023. Data set ini menerangkan mengenai ketagihan dadah mengikut jantina di setiap negeri di Malaysia",
    "title_sort": "10",
    "exclude_openapi": false,
    "manual_trigger": "",
    "data_as_of": "2025-06-30 00:00:00.000 +08:00",
    "frequency": "YEARLY",
    "geography": [
        "NATIONAL",
        "STATE"
    ],
    "demography": [
        "SEX",
        "NATIONALITY"
    ],
    "dataset_begin": "2015",
    "dataset_end": "2023",
    "data_source": [
        "AADK"
    ],
    "methodology_en": "The data is collected annually from reports prepared by the National Anti-Drugs Agency (AADK), which is involved in drug rehabilitation and enforcement in Malaysia. This data covers the number of identified drug addicts by gender each year across all states and national level",
    "methodology_ms": "Data dikumpulkan setiap tahun dari laporan yang disediakan oleh Agensi Anti Dadah Kebangsaan (AADK) yang terlibat dalam pemulihan dan penguatkuasaan dadah di Malaysia. Data ini merangkumi jumlah penagih dadah mengikut jantina yang dikenal pasti setiap tahun di semua negeri dan di peringkat kebangsaan.",
    "caveat_en": "This dataset does not reflect the actual number of drug addicts as it only relies on cases reported by state agencies. Some cases may not be recorded and the data also does not include individuals who have no contact with the agencies.",
    "caveat_ms": "Dataset ini tidak mencerminkan jumlah sebenar penagih dadah kerana data ini hanya bergantung pada kes yang dilaporkan oleh agensi negeri. Sebahagian kes mungkin tidak direkodkan dan data ini juga tidak merangkumi individu yang tidak berhubung dengan agensi.",
    "publication_en": "N/A",
    "publication_ms": "N/A",
    "related_datasets": [],
    "last_updated": "2025-09-24 09:29:40.559 +08:00",
    "next_update": "-",
    "fields": [
        {
            "name": "State",
            "title_en": "State",
            "title_ms": "Negeri",
            "description_en": "The state in Malaysia where the data is recorded. Includes all 16 states and federal territories.",
            "description_ms": "Negeri di Malaysia di mana data direkodkan. Termasuk semua 16 negeri dan wilayah persekutuan."
        },
        {
            "name": "Year",
            "title_en": "Year",
            "title_ms": "Tahun",
            "description_en": "The year in which the data was recorded.",
            "description_ms": "Tahun di mana data direkodkan."
        },
        {
            "name": "Total",
            "title_en": "Total",
            "title_ms": "Jumlah",
            "description_en": "The total number of drug addicts recorded in the specified year and state.",
            "description_ms": "Jumlah keseluruhan penagih dadah yang direkodkan dalam tahun dan negeri yang ditentukan."
        },
        {
            "name": "Male",
            "title_en": "Male",
            "title_ms": "Lelaki",
            "description_en": "The number of male drug addicts recorded in the specified year and state.",
            "description_ms": "Bilangan penagih dadah lelaki yang direkodkan dalam tahun dan negeri yang ditentukan."
        },
        {
            "name": "Female",
            "title_en": "Female",
            "title_ms": "Perempuan",
            "description_en": "The number of female drug addicts recorded in the specified year and state.",
            "description_ms": "Bilangan penagih dadah perempuan yang direkodkan dalam tahun dan negeri yang ditentukan."
        }
    ],
    "translations_en": {
        "State": "State",
        "Year": "Year",
        "Total": "Total",
        "Male": "Male",
        "Female": "Female"
    },
    "translations_ms": {
        "State": "Negeri",
        "Year": "Tahun",
        "Total": "Jumlah",
        "Male": "Lelaki",
        "Female": "Perempuan"
    },
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Public Safety",
            "category_ms": "Keselamatan Awam",
            "category_sort": 42,
            "subcategory_en": "Crime",
            "subcategory_ms": "Jenayah",
            "subcategory_sort": 10
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ]
}