{
    "link_csv": "https://storage.data.gov.my/dev/aida_epf_dividend.csv",
    "link_parquet": "https://storage.data.gov.my/dev/aida_epf_dividend.parquet",
    "link_preview": "https://storage.data.gov.my/dev/aida_epf_dividend.parquet",
    "title_en": "EPF Dividend Rates",
    "title_ms": "Kadar Dividen KWSP",
    "description_en": "This dataset provides the annual dividend rates declared by the Employees Provident Fund (EPF) in Malaysia for both conventional and shariah savings. The dataset includes historical data on dividend rates from the year 1960 onwards.",
    "description_ms": "Set data ini menyediakan kadar dividen tahunan yang diisytiharkan oleh Kumpulan Wang Simpanan Pekerja (KWSP) di Malaysia untuk simpanan konvensional dan syariah. Set data ini merangkumi data sejarah mengenai kadar dividen dari tahun 1960 dan seterusnya.",
    "title_sort": 1,
    "exclude_openapi": false,
    "manual_trigger": "",
    "data_as_of": "2025-09-23 11:12:00.000 +08:00",
    "frequency": "YEARLY",
    "geography": [
        "NATIONAL"
    ],
    "demography": [],
    "dataset_begin": "1952",
    "dataset_end": "2024",
    "data_source": [
        "EPF"
    ],
    "methodology_en": "The EPF dividend rates are declared annually based on the performance of investments made by the fund. The rates are determined by the EPF Board and are influenced by the returns on investments in various asset classes such as equities, bonds, and real estate. The dataset records these rates as declared at the start of each year.",
    "methodology_ms": "Kadar dividen KWSP diisytiharkan setiap tahun berdasarkan prestasi pelaburan yang dibuat oleh dana tersebut. Kadar ini ditentukan oleh Lembaga KWSP dan dipengaruhi oleh pulangan pelaburan dalam pelbagai kelas aset seperti ekuiti, bon, dan hartanah. Set data ini merekodkan kadar ini seperti yang diisytiharkan pada awal setiap tahun.",
    "caveat_en": "The dataset may have missing values for shariah dividend rates in earlier years as the shariah savings scheme was introduced later. Users should also note that the dividend rates are subject to change based on the financial performance of the EPF's investments.",
    "caveat_ms": "Set data ini mungkin mempunyai nilai yang hilang untuk kadar dividen syariah pada tahun-tahun awal kerana skim simpanan syariah diperkenalkan kemudian. Pengguna juga harus ambil perhatian bahawa kadar dividen tertakluk kepada perubahan berdasarkan prestasi kewangan pelaburan KWSP.",
    "publication_en": "N/A",
    "publication_ms": "N/A",
    "related_datasets": [],
    "last_updated": "2025-09-23 11:10:28.219 +08:00",
    "next_update": "-",
    "fields": [
        {
            "name": "Year",
            "title_en": "Year",
            "title_ms": "Tahun",
            "description_en": "The year for which the dividend rate is declared, formatted as YYYY-MM-DD with MM-DD set to 01-01.",
            "description_ms": "Tahun di mana kadar dividen diisytiharkan, diformatkan sebagai YYYY-MM-DD dengan MM-DD ditetapkan kepada 01-01."
        },
        {
            "name": "conventional",
            "title_en": "Conventional Dividend Rate",
            "title_ms": "Kadar Dividen Konvensional",
            "description_en": "The dividend rate declared for conventional savings by the EPF for the specified year, expressed as a percentage.",
            "description_ms": "Kadar dividen yang diisytiharkan untuk simpanan konvensional oleh KWSP untuk tahun yang dinyatakan, dinyatakan sebagai peratusan."
        },
        {
            "name": "shariah",
            "title_en": "Shariah Dividend Rate",
            "title_ms": "Kadar Dividen Syariah",
            "description_en": "The dividend rate declared for shariah savings by the EPF for the specified year, expressed as a percentage. This may be unavailable for years before the shariah scheme was introduced.",
            "description_ms": "Kadar dividen yang diisytiharkan untuk simpanan syariah oleh KWSP untuk tahun yang dinyatakan, dinyatakan sebagai peratusan. Ini mungkin tidak tersedia untuk tahun sebelum skim syariah diperkenalkan."
        }
    ],
    "translations_en": {
        "Year": "Year",
        "conventional": "Conventional Dividend Rate",
        "shariah": "Shariah Dividend Rate"
    },
    "translations_ms": {
        "Year": "Tahun",
        "conventional": "Kadar Dividen Konvensional",
        "shariah": "Kadar Dividen Syariah"
    },
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Public Welfare",
            "category_ms": "Kebajikan Awam",
            "category_sort": 43,
            "subcategory_en": "Retirement",
            "subcategory_ms": "Persaraan",
            "subcategory_sort": 10
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ]
}