{
    "link_csv": "https://storage.data.gov.my/demography/births.csv",
    "link_parquet": "https://storage.data.gov.my/demography/births.parquet",
    "link_preview": "",
    "title_en": "Annual Births Data in Malaysia",
    "title_ms": "Data Kelahiran Tahunan di Malaysia",
    "description_en": "This dataset provides the annual number of births in Malaysia, categorized by date and state. It is a comprehensive record of births across different years, offering insights into demographic trends at a national level.",
    "description_ms": "Set data ini menyediakan jumlah kelahiran tahunan di Malaysia, dikategorikan mengikut tarikh dan negeri. Ia adalah rekod menyeluruh kelahiran merentasi pelbagai tahun, menawarkan pandangan tentang trend demografi di peringkat kebangsaan.",
    "title_sort": 1,
    "exclude_openapi": false,
    "manual_trigger": "",
    "data_as_of": "2025-09-06 23:04:00.000 +08:00",
    "frequency": "YEARLY",
    "geography": [
        "NATIONAL"
    ],
    "demography": [
        "ETHNICITY"
    ],
    "dataset_begin": 2025,
    "dataset_end": 2025,
    "data_source": [
        "AADK"
    ],
    "methodology_en": "The dataset compiles birth records registered across Malaysia, aggregated annually. The data is collected from official birth registration records, ensuring accuracy and consistency. Each entry represents the total number of births recorded on a specific date within Malaysia.",
    "methodology_ms": "Set data ini mengumpulkan rekod kelahiran yang didaftarkan di seluruh Malaysia, dikumpulkan secara tahunan. Data dikumpulkan daripada rekod pendaftaran kelahiran rasmi, memastikan ketepatan dan konsistensi. Setiap entri mewakili jumlah keseluruhan kelahiran yang direkodkan pada tarikh tertentu di Malaysia.",
    "caveat_en": "The dataset only includes births that have been officially registered. Unregistered births, if any, are not represented in this dataset. Additionally, the dataset does not break down births by ethnicity or other demographic factors.",
    "caveat_ms": "Set data ini hanya merangkumi kelahiran yang telah didaftarkan secara rasmi. Kelahiran yang tidak didaftarkan, jika ada, tidak diwakili dalam set data ini. Selain itu, set data ini tidak memecahkan kelahiran mengikut etnik atau faktor demografi lain.",
    "publication_en": "N/A",
    "publication_ms": "N/A",
    "related_datasets": [],
    "last_updated": "2025-09-21 23:03:10.756 +08:00",
    "next_update": "-",
    "fields": [
        {
            "name": "date",
            "title_en": "Date",
            "title_ms": "Tarikh",
            "description_en": "The date when the births were recorded, in YYYY-MM-DD format.",
            "description_ms": "Tarikh apabila kelahiran direkodkan, dalam format YYYY-MM-DD."
        },
        {
            "name": "state",
            "title_en": "State",
            "title_ms": "Negeri",
            "description_en": "The state within Malaysia where the births were recorded.",
            "description_ms": "Negeri di Malaysia di mana kelahiran direkodkan."
        },
        {
            "name": "births",
            "title_en": "Number of Births",
            "title_ms": "Bilangan Kelahiran",
            "description_en": "The total number of births recorded on the specified date in the specified state.",
            "description_ms": "Jumlah keseluruhan kelahiran yang direkodkan pada tarikh yang dinyatakan di negeri yang dinyatakan."
        }
    ],
    "translations_en": {},
    "translations_ms": {},
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Demography",
            "category_ms": "Demografi",
            "category_sort": 1,
            "subcategory_en": "Deaths",
            "subcategory_ms": "Kematian",
            "subcategory_sort": 3
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ]
}