{
    "title_en": "Cancelled Cosmetic Product Notifications",
    "title_ms": "Produk Komestik Dibatalkan Notifikasi",
    "title_sort": 80,
    "description_en": "Complete list of comsetic products found to contain banned substances, with their notification subsequently cancelled by the Drug Control Authority. The table provides a preview of the dataset using 10 records as a sample.",
    "description_ms": "Senarai penuh produk kosmetik yang telah didapati mengandungi bahan larangan, dan seterusnya dibatalkan notifikasinya oleh Pihak Berkuasa Kawalan Dadah. Jadual memberi pratonton kepada set data dengan menggunakan 10 rekod sebagai contoh.",
    "exclude_openapi": true,
    "manual_trigger": "",
    "data_as_of": "2025-07-12 23:59",
    "last_updated": "2025-07-13 12:00",
    "next_update": "2025-07-14 12:00",
    "methodology_en": "In accordance with the Control of Drugs and Cosmetics Regulations 1984, all pharmaceutical, health and personal care products marketed in Malaysia must be registered and approved by the Drug Control Authority (DCA). For cosmetics specifically, a 'notification' must be submitted to NPRA via the QUEST3+ system, which is the administrative system used by NPRA to enable the online management of product registrations, variations, licensing, market sampling, renewal and others. This dataset is an exact copy of the administrative record of cosmetic products with cancelled notifications, with any columns containing personal data excluded.\n\nThese products have been found to contain prohibited substances, including scheduled poisons that are not permitted in cosmetic products. The use of cosmetic products adulterated with such chemicals as detected can cause serious adverse effects.",
    "methodology_ms": "Selaras dengan Peraturan Kawalan Dadah dan Kosmetik 1984, semua produk farmaseutikal, kesihatan, dan penjagaan peribadi yang dipasarkan di Malaysia mesti didaftarkan dan diluluskan oleh Pihak Berkuasa Kawalan Dadah. Bagi produk kosmetik khususnya, satu 'notifikasi' perlu dihantar ke NPRA melalui sistem QUEST3+, iaitu sistem pentadbiran yang digunakan oleh NPRA untuk membolehkan pengurusan dalam talian bagi pendaftaran produk, variasi, pelesenan, pensampelan pasaran, pembaharuan, dan lain-lain. Set data ini adalah salinan rekod pentadbiran produk kosmetik yang dibatalkan notifikasinya, dengan mana-mana medan yang mengandungi data peribadi dikecualikan.\n\nProduk tersebut telah didapati mengandungi bahan larangan, termasuk racun berjadual yang tidak dibenarkan dalam produk kosmetik. Penggunaan produk kosmetik yang dicampurpalsu dengan bahan kimia seperti yang telah dikesan boleh menyebabkan kesan advers serius.",
    "caveat_en": "Although this data represents administrative records, it nevertheless remains a static dataset which is updated once per day, rather than in real time. As such, this dataset should not be used as the basis for any legal action. Any queries on enforcement of the relevant laws of Malaysia should always be referred to the National Pharmaceutical Regulatory Agency (NPRA).",
    "caveat_ms": "Walaupun set data ini adalah data pentadbiran, ia masih merupakan set data statik yang dikemaskini sekali sehari dan bukkannya dalam masa sebenar (_real time_). Oleh itu, set data ini tidak harus digunakan sebagai asas untuk sebarang tindakan undang-undang. Sebarang pertanyaan mengenai penguatkuasaan undang-undang Malaysia yang berkaitan harus dirujuk kepada Bahagian Regulatori Farmasi Negara (NPRA).",
    "publication_en": "—",
    "publication_ms": "—",
    "link_parquet": "https://storage.data.gov.my/healthcare/cosmetic_notifications_cancelled.parquet",
    "link_csv": "https://storage.data.gov.my/healthcare/cosmetic_notifications_cancelled.csv",
    "link_preview": "https://storage.data.gov.my/healthcare/cosmetic_notifications_cancelled_preview.parquet",
    "frequency": "DAILY",
    "geography": [
        "NATIONAL"
    ],
    "demography": [],
    "dataset_begin": 2024,
    "dataset_end": 2024,
    "data_source": [
        "NPRA",
        "MOH"
    ],
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Healthcare",
            "category_ms": "Kesihatan",
            "category_sort": 40,
            "subcategory_en": "Regulation",
            "subcategory_ms": "Kawal Selia",
            "subcategory_sort": 40
        },
        {
            "site": "kkmnow",
            "category_en": "Regulation",
            "category_ms": "Program Kesihatan",
            "category_sort": 40,
            "subcategory_en": "Products",
            "subcategory_ms": "Produk",
            "subcategory_sort": 20
        }
    ],
    "fields": [
        {
            "name": "notif_no",
            "title_en": "Notification Number",
            "title_ms": "Nombor Notifikasi",
            "description_en": "[String] Unique identifier for the product's notification",
            "description_ms": "[Rentetan] Pengenalpasti unik bagi notifikasi produk"
        },
        {
            "name": "product",
            "title_en": "Product Name",
            "title_ms": "Nama Produk",
            "description_en": "[String] Name of the product",
            "description_ms": "[Rentetan] Nama produk"
        },
        {
            "name": "holder",
            "title_en": "Holder",
            "title_ms": "Pemegang",
            "description_en": "[String] Company or entity holding the notification",
            "description_ms": "[Rentetan] Syarikat atau entiti yang memegang notifikasi"
        },
        {
            "name": "manufacturer",
            "title_en": "Manufacturer",
            "title_ms": "Pengilang",
            "description_en": "[String] Name of the manufacturer of the product",
            "description_ms": "[Rentetan] Nama pengilang produk"
        },
        {
            "name": "substance_detected",
            "title_en": "Substance Detected",
            "title_ms": "Bahan Dikesan",
            "description_en": "[String] Banned substance(s) found in the product causing its notification to be cancelled",
            "description_ms": "[Rentetan] Bahan larangan yang terkesan dalam produk menyebabkan notifikasinya dibatalkan"
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ],
    "translations_en": {},
    "translations_ms": {},
    "related_datasets": []
}