{
	"title_en": "Household Income by State & Percentile",
	"title_ms": "Pendapatan Isi Rumah mengikut Negeri & Persentil",
	"title_sort": 11,
	"description_en": "Percentile-resolution household income data at state level.",
	"description_ms": "Data pendapatan isi rumah peringkat negeri pada resolusi persentil.",
	"exclude_openapi": false,
	"manual_trigger": "",
	"data_as_of": "2024",
	"last_updated": "2025-10-08 12:00",
	"next_update": "TBC",
	"methodology_en": "This data is is based on Household Income Surveys (HIS) and Household Income & Expenditure Surveys (HIES) carried out from 1970 to 2022. The survey is carried out at least twice in any rolling five-year period to produce representative data regarding income, poverty and access to basic amenities for Malaysian households. In particular, this dataset provides deeper insight into the distribution of household income at state level, by tabulating key household income metrics by percentile (100 equally sized groups), rather than the typically-published decile (10 groups) or quartile (4 groups). There are 4 metrics on monthly household income provided in the dataset:\n - *Mean* for percentile K, which is the average among households within percentile K only.\n - *Median* for percentile K, which is the median among households in percentile K only. An additional implication is that (K - 0.5)% of households have monthly household income less than or equal to this amount. For example, 12.5% of households have monthly household income less than or equal to the median _within_ the 13th percentile.\n - *Minimum* income for percentile K, which is the minimum among households in percentile K. All households within percentile K have income greater than or equal to this amount.\n - *Maximum* income for percentile K, which is the maximum among households in percentile K. No households within percentile K have income exceeding this amount.",
	"methodology_ms": "Data ini dihasilkan berdasarkan Survei Pendapatan Isi Rumah (HIS) serta Survei Pendapatan dan Perbelanjaan Isi Rumah (HIES) yang dilaksanakan dari tahun 1970 ke 2022. Survei itu dilaksanakan dua kali dalam mana-mana tempoh lima tahun bagi tujuan menghasilkan data pendapatan, kemiskinan dan akses kepada kemudahan asas bagi isi rumah warganegara. Khususnya, set data ini membolehkan analisis yang lebih mendalam tentang taburan pendapatan isi rumah pada peringkat negeri dengan membekalkan data pendapatan isi rumah pada resolusi persentil (100 kumpulan bersaiz sama), berbanding resolusi desil (10 kumpulan) atau kuartil (4 kumpulan) seperti yang biasanya diterbitkan. Terdapat 4 metrik pendapatan isi rumah bulanan yang dibekalkan:\n - *Min* untuk persentil K, iaitu purata antara isi rumah dalam persentil K sahaja.\n - *Median* untuk persentil K, iaitu median antara isi rumah dalam persentil K sahaja. Implikasi tambahan adalah (K - 0.5)% isi rumah mempunyai pendapatan isi rumah bulanan kurang daripada atau sama dengan jumlah ini. Sebagai contoh, 12.5% isi rumah mempunyai pendapatan isi rumah bulanan kurang daripada atau sama dengan median persentil ke-13.\n - *Pendapatan minimum* untuk persentil K, iaitu minimum antara isi rumah dalam persentil K. Semua isi rumah dalam persentil K mempunyai pendapatan lebih daripada atau sama dengan jumlah ini.\n - *Maksimum* pendapatan untuk persentil K, iaitu maksimum antara isi rumah dalam persentil K. Tiada isi rumah dalam persentil K yang mempunyai pendapatan melebihi jumlah ini.",
	"caveat_en": "This data should be used with caution as the relative standard errors are larger due to the higher resolution. For a full account of the relative standard errors for the survey as well as the detailed survey methodology, please refer to the [HIES Technical Notes](https://storage.googleapis.com/dosm-public-publications/technote_hies_income_en.pdf).",
	"caveat_ms": "Set data ini harus diguna dengan berhati-hati kerana ralat piawai lebih besar akibat resolusi yang lebih tinggi. Untuk mendapat butiran penuh tentang ralat piawai survei serta metodologi yang terperinci, sila rujuk kepada [Nota Teknikal HIES](https://storage.googleapis.com/dosm-public-publications/technote_hies_income_bm.pdf).",
	"publication_en": "The [Household Income Survey Report, 2024](https://open.dosm.gov.my/publications/household_income_2024).",
	"publication_ms": "[Laporan Survei Pendapatan Isi Rumah, 2024](https://open.dosm.gov.my/ms-MY/publications/household_income_2024).",
	"link_parquet": "https://storage.dosm.gov.my/hies/hies_state_percentile.parquet",
	"link_csv": "https://storage.dosm.gov.my/hies/hies_state_percentile.csv",
	"frequency": "YEARLY",
	"geography": ["STATE"],
	"demography": [],
	"dataset_begin": 2019,
	"dataset_end": 2024,
	"data_source": ["DOSM"],
	"data_source_granular": [
	  "BPHPP"
	],
	"site_category": [
        {
          "site": "datagovmy",
          "category_en": "Households",
          "category_ms": "Isi Rumah",
          "category_sort": 2,
          "subcategory_en": "Income",
          "subcategory_ms": "Pendapatan",
          "subcategory_sort": 20
        },
        {
          "site": "opendosm",
          "category_en": "Households",
          "category_ms": "Isi Rumah",
          "category_sort": 2,
          "subcategory_en": "Income",
          "subcategory_ms": "Pendapatan",
          "subcategory_sort": 20
        }
	],
	"fields": [
		{
			"name": "date",
			"title_en": "Date",
			"title_ms": "Tarikh",
			"description_en": "[Date] The date in YYYY-MM-DD format, with MM-DD set to 01-01 as this is annual data",
			"description_ms": "[Tarikh] Tarikh dalam format YYYY-MM-DD, dengan MM-DD diberi nilai 01 kerana ini adalah data tahunan"
		},
		{
			"name": "state",
			"title_en": "State",
			"title_ms": "Negeri",
			"description_en": "[Categorical] One of 16 states",
			"description_ms": "[Kategoril] Satu daripada 16 negeri"
		},
		{
			"name": "percentile",
			"title_en": "Percentile",
			"title_ms": "Persentil",
			"description_en": "[Integer] Number from 1 to 100",
			"description_ms": "[Tarikh] Angka dari 1 hingga 100"
		},
		{
			"name": "variable",
			"title_en": "Variable",
			"title_ms": "Pembolehubah",
			"description_en": "[Categorical] Either mean, median, minimum or maximum, as explained in the methodology",
			"description_ms": "[Kategori] Sama ada min, median, minimum atau maksimum, seperti yang diterangkan dalam metodologi"
		},
		{
			"name": "income",
			"title_en": "Income",
			"title_ms": "Pendapatan",
			"description_en": "[Integer, RM] Gross monthly household income, in RM. Values for the minimum for the 1st percentile and maximum for the 100th percentile have been nulled due to identifiability concerns.",
			"description_ms": "[Integer, RM] Pendapatan kasar bulanan isi rumah, dalam RM. Nilai minimum bagi persentil pertama dan maksimum bagi persentil ke-100 telah dikeluarkan untuk memelihara privasi."
		}
	],
	"dataviz": [
		{
			"dataviz_id": "table",
			"title_en": "Table",
			"title_ms": "Jadual",
			"chart_type": "TABLE",
			"config": {
				"precision": 0,
				"filter_columns": ["state", "variable"],
				"freeze_columns": []
			}
		},
		{
			"dataviz_id": "bar",
			"title_en": "Household Income Distribution",
			"title_ms": "Taburan Pendapatan Isi Rumah",
			"chart_type": "BAR",
			"config": {
				"slider": {
					"key": "date",
					"interval": "year"
				},
				"precision": 0,
				"filter_columns": ["state", "variable"],
				"format": {
					"x": "percentile",
					"y": ["income"]
				}
			}
		}
	],
	"translations_en": {
		"date": "Date",
		"state": "State",
		"district": "District",
		"percentile": "Percentile",
		"variable": "Variable",
		"income": "Income",
		"mean": "Mean",
		"median": "Median",
		"minimum": "Minimum",
		"maximum": "Maximum",
		"y1": "Income"
	},
	"translations_ms": {
		"date": "Tarikh",
		"state": "Negeri",
		"district": "Daerah",
		"percentile": "Persentil",
		"variable": "Pembolehubah",
		"income": "Pendapatan",
		"mean": "Min",
		"median": "Median",
		"minimum": "Minimum",
		"maximum": "Maksimum",
		"y1": "Pendapatan"
	},
	"related_datasets": []
}
