{
    "link_csv": "https://storage.data.gov.my/dev/legal_advisory_category.csv",
    "link_parquet": "https://storage.data.gov.my/dev/legal_advisory_category.parquet",
    "link_preview": "https://storage.data.gov.my/dev/legal_advisory_category.parquet",
    "title_en": "Legal Advisory Services by Category",
    "title_ms": "Perkhidmatan Nasihat Undang-Undang Mengikut Kategori",
    "description_en": "This data refers to the records of legal advice services that has been registered via the Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG), handled by the Legal Aid Department of Malaysia (JBG). The numbers include legal advice services given all across Malaysia by JBG and is classified by main category as shown below. The data shared aims to support the transparency, research and analysis pertaining to the accessibility of legal aid services in Malaysia.",
    "description_ms": "Set data ini merekodkan perkhidmatan nasihat undang-undang yang didaftarkan melalui Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG), yang dikendalikan oleh Jabatan Bantuan Guaman Malaysia (JBG). Data ini merangkumi perkhidmatan nasihat undang-undang yang diberikan di seluruh Malaysia oleh JBG, yang dikategorikan mengikut kategori utama. Set data ini bertujuan untuk menyokong ketelusan, penyelidikan, dan analisis mengenai kebolehcapaian perkhidmatan bantuan guaman di Malaysia.",
    "title_sort": "2",
    "exclude_openapi": false,
    "manual_trigger": "",
    "data_as_of": "2025-01-01 00:01:00.000 +08:00",
    "frequency": "MONTHLY",
    "geography": [
        "NATIONAL",
        "STATE",
        "DISTRICT"
    ],
    "demography": [],
    "dataset_begin": "2022",
    "dataset_end": 2025,
    "data_source": [
        "JBG"
    ],
    "methodology_en": "The data is collected and managed by the Legal Aid Department of Malaysia (JBG) through the Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG). It includes monthly records of legal advice services categorized by main category and provided across various regions in Malaysia. The dataset is updated monthly to reflect the most current data available.",
    "methodology_ms": "Data ini dikumpul dan diuruskan oleh Jabatan Bantuan Guaman Malaysia (JBG) melalui Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG). Ia merangkumi rekod bulanan perkhidmatan nasihat undang-undang yang dikategorikan mengikut kategori utama dan disediakan di pelbagai kawasan di Malaysia. Set data ini dikemas kini setiap bulan untuk mencerminkan data terkini yang tersedia.",
    "caveat_en": "The dataset may not cover all legal advisory services provided in Malaysia as it only includes those registered through SPK-JBG. Additionally, there may be discrepancies in categorization due to differences in interpretation or data entry errors.",
    "caveat_ms": "Set data ini mungkin tidak merangkumi semua perkhidmatan nasihat undang-undang yang disediakan di Malaysia kerana ia hanya merangkumi yang didaftarkan melalui SPK-JBG. Selain itu, mungkin terdapat ketidaktepatan dalam pengkategorian disebabkan oleh perbezaan dalam tafsiran atau kesilapan kemasukan data.",
    "publication_en": "N/A",
    "publication_ms": "N/A",
    "related_datasets": [],
    "last_updated": "2025-11-17 15:32:00.931 +08:00",
    "next_update": "-",
    "fields": [
        {
            "name": "tarikh",
            "title_en": "Date",
            "title_ms": "Tarikh",
            "description_en": "The date when the legal advisory service was recorded, in YYYY-MM-DD format.",
            "description_ms": "Tarikh apabila perkhidmatan nasihat undang-undang direkodkan, dalam format YYYY-MM-DD."
        },
        {
            "name": "cawangan",
            "title_en": "Branch",
            "title_ms": "Cawangan",
            "description_en": "The branch or location where the legal advisory service was provided.",
            "description_ms": "Cawangan atau lokasi di mana perkhidmatan nasihat undang-undang disediakan."
        },
        {
            "name": "kategori utama",
            "title_en": "Main Category",
            "title_ms": "Kategori Utama",
            "description_en": "The main category of the legal advisory service provided, such as Civil, Syariah, or Criminal.",
            "description_ms": "Kategori utama perkhidmatan nasihat undang-undang yang disediakan, seperti Sivil, Syariah, atau Jenayah."
        },
        {
            "name": "jumlah",
            "title_en": "Total",
            "title_ms": "Jumlah",
            "description_en": "The total number of legal advisory services provided under the specified category and branch.",
            "description_ms": "Jumlah keseluruhan perkhidmatan nasihat undang-undang yang disediakan di bawah kategori dan cawangan yang dinyatakan."
        }
    ],
    "translations_en": {
        "tarikh": "Date",
        "cawangan": "Branch",
        "kategori utama": "Main Category",
        "jumlah": "Total"
    },
    "translations_ms": {
        "tarikh": "Tarikh",
        "cawangan": "Cawangan",
        "kategori utama": "Kategori Utama",
        "jumlah": "Jumlah"
    },
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Public Safety",
            "category_ms": "Keselamatan Awam",
            "category_sort": 42,
            "subcategory_en": "Justice",
            "subcategory_ms": "Keadilan",
            "subcategory_sort": 20
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ]
}