{
    "link_csv": "https://storage.data.gov.my/dev/khidmat_nasihat_jbg_kategori.csv",
    "link_parquet": "https://storage.data.gov.my/dev/khidmat_nasihat_jbg_kategori.parquet",
    "link_preview": "https://storage.data.gov.my/dev/khidmat_nasihat_jbg_kategori.parquet",
    "title_en": "Legal Advisory Services by Main Category",
    "title_ms": "Perkhidmatan Nasihat Undang-Undang Mengikut Kategori Utama",
    "description_en": "This dataset presents records of legal advisory sessions registered through the Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG), managed by the Legal Aid Department under the Prime Minister’s Department. It includes consultations across all branches in Malaysia, classified by main category (Shariah, Crime, or Civil). The dataset aims to support transparency, research, and analysis related to the accessibility and scope of legal aid services in Malaysia.",
    "description_ms": "Set data ini memaparkan rekod sesi nasihat undang-undang yang didaftarkan melalui Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG), yang diuruskan oleh Jabatan Bantuan Guaman di bawah Jabatan Perdana Menteri. Ia merangkumi konsultasi di semua cawangan di Malaysia, yang dikelaskan mengikut kategori utama (Syariah, Jenayah, atau Sivil). Set data ini bertujuan untuk menyokong ketelusan, penyelidikan, dan analisis berkaitan aksesibiliti dan skop perkhidmatan bantuan guaman di Malaysia.",
    "title_sort": "3",
    "exclude_openapi": false,
    "manual_trigger": "",
    "data_as_of": "2024-12-31 00:00:00.000 +08:00",
    "frequency": "YEARLY",
    "geography": [
        "STATE"
    ],
    "demography": [],
    "dataset_begin": "2024",
    "dataset_end": "2024",
    "data_source": [
        "JBG"
    ],
    "methodology_en": "The data is collected annually from the Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG), which records all legal advisory sessions conducted by the Legal Aid Department across Malaysia. Each record is categorized into one of three main categories: Shariah, Crime, or Civil. The data is aggregated by branch and date of session.",
    "methodology_ms": "Data ini dikumpulkan setiap tahun dari Sistem Pengurusan Kes Jabatan Bantuan Guaman (SPK-JBG), yang merekod semua sesi nasihat undang-undang yang dijalankan oleh Jabatan Bantuan Guaman di seluruh Malaysia. Setiap rekod dikategorikan ke dalam salah satu daripada tiga kategori utama: Syariah, Jenayah, atau Sivil. Data ini diagregatkan mengikut cawangan dan tarikh sesi.",
    "caveat_en": "The dataset may not capture all legal advisory sessions if they were not recorded in the SPK-JBG system. Additionally, the classification of cases into Shariah, Crime, or Civil is based on the initial categorization which may not reflect the final legal outcome.",
    "caveat_ms": "Set data ini mungkin tidak merangkumi semua sesi nasihat undang-undang jika ia tidak direkodkan dalam sistem SPK-JBG. Selain itu, pengelasan kes ke dalam Syariah, Jenayah, atau Sivil adalah berdasarkan pengkategorian awal yang mungkin tidak mencerminkan hasil undang-undang akhir.",
    "publication_en": "N/A",
    "publication_ms": "N/A",
    "related_datasets": [],
    "last_updated": "2025-10-13 11:14:04.333 +08:00",
    "next_update": "-",
    "fields": [
        {
            "name": "tarikh",
            "title_en": "Date",
            "title_ms": "Tarikh",
            "description_en": "The date on which the legal advisory session took place, recorded in YYYY-MM-DD format.",
            "description_ms": "Tarikh sesi nasihat undang-undang diadakan, direkodkan dalam format YYYY-MM-DD."
        },
        {
            "name": "cawangan",
            "title_en": "Branch",
            "title_ms": "Cawangan",
            "description_en": "The branch of the Legal Aid Department where the advisory session was conducted.",
            "description_ms": "Cawangan Jabatan Bantuan Guaman di mana sesi nasihat dijalankan."
        },
        {
            "name": "kategori utama",
            "title_en": "Main Category",
            "title_ms": "Kategori Utama",
            "description_en": "The main category of the legal advisory session, classified as Shariah, Crime, or Civil.",
            "description_ms": "Kategori utama sesi nasihat undang-undang, dikelaskan sebagai Syariah, Jenayah, atau Sivil."
        },
        {
            "name": "Jumlah Kes",
            "title_en": "Number of Cases",
            "title_ms": "Jumlah Kes",
            "description_en": "The number of legal advisory cases recorded in the session.",
            "description_ms": "Bilangan kes nasihat undang-undang yang direkodkan dalam sesi tersebut."
        }
    ],
    "translations_en": {
        "tarikh": "Date",
        "cawangan": "Branch",
        "kategori utama": "Main Category",
        "Jumlah Kes": "Number of Cases"
    },
    "translations_ms": {
        "tarikh": "Tarikh",
        "cawangan": "Cawangan",
        "kategori utama": "Kategori Utama",
        "Jumlah Kes": "Jumlah Kes"
    },
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Public Safety",
            "category_ms": "Keselamatan Awam",
            "category_sort": 42,
            "subcategory_en": "Justice",
            "subcategory_ms": "Keadilan",
            "subcategory_sort": 20
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ]
}