{
    "link_csv": "https://storage.data.gov.my/metrics/metrics_agg.csv",
    "link_parquet": "https://storage.data.gov.my/metrics/metrics_agg.parquet",
    "link_preview": "https://storage.data.gov.my/metrics/metrics_agg.parquet",
    "title_en": "Metric API Usage and Downloads",
    "title_ms": "Penggunaan API dan Muat Turun Metric",
    "description_en": "This dataset provides monthly data on the usage of the Metric API, including the number of views, API hits, and file downloads. It is designed to help users understand the trends and patterns in API usage and file downloads over time.",
    "description_ms": "Set data ini menyediakan data bulanan mengenai penggunaan API Metric, termasuk bilangan tontonan, hits API, dan muat turun fail. Ia direka untuk membantu pengguna memahami trend dan corak dalam penggunaan API dan muat turun fail dari masa ke masa.",
    "title_sort": "12",
    "exclude_openapi": false,
    "manual_trigger": "",
    "data_as_of": "2025-09-22 00:01:00.000 +08:00",
    "frequency": "MONTHLY",
    "geography": [
        "NATIONAL"
    ],
    "demography": [
        "NATIONALITY"
    ],
    "dataset_begin": "2024",
    "dataset_end": 2025,
    "data_source": [
        "PDRM"
    ],
    "methodology_en": "Data is collected on a monthly basis to capture the usage statistics of the Metric API. This includes tracking the number of views, API hits, and downloads. The data is aggregated and made available for analysis to understand usage trends and patterns.",
    "methodology_ms": "Data dikumpul setiap bulan untuk menangkap statistik penggunaan API Metric. Ini termasuk menjejaki bilangan tontonan, hits API, dan muat turun. Data ini diagregatkan dan disediakan untuk analisis bagi memahami trend dan corak penggunaan.",
    "caveat_en": "The dataset is limited to the information captured through the Metric API and may not reflect all types of interactions or usage. Data accuracy depends on the proper functioning of the API tracking mechanisms.",
    "caveat_ms": "Set data ini terhad kepada maklumat yang ditangkap melalui API Metric dan mungkin tidak mencerminkan semua jenis interaksi atau penggunaan. Ketepatan data bergantung kepada fungsi yang betul dari mekanisme penjejakan API.",
    "publication_en": "'-'",
    "publication_ms": "'-'",
    "related_datasets": [],
    "last_updated": "2025-09-22 12:01:18.900 +08:00",
    "next_update": "-",
    "fields": [
        {
            "name": "date",
            "title_en": "Date",
            "title_ms": "Tarikh",
            "description_en": "The date of the recorded data in YYYY-MM-DD format, indicating when the data was collected.",
            "description_ms": "Tarikh data yang direkodkan dalam format YYYY-MM-DD, menunjukkan bila data dikumpulkan."
        },
        {
            "name": "views",
            "title_en": "Views",
            "title_ms": "Tontonan",
            "description_en": "The number of times the Metric API page was viewed during the specified period.",
            "description_ms": "Bilangan kali halaman API Metric dilihat dalam tempoh yang ditentukan."
        },
        {
            "name": "api_hits",
            "title_en": "API Hits",
            "title_ms": "Hits API",
            "description_en": "The total number of API requests made during the specified period.",
            "description_ms": "Jumlah keseluruhan permintaan API yang dibuat dalam tempoh yang ditentukan."
        },
        {
            "name": "downloads",
            "title_en": "Downloads",
            "title_ms": "Muat Turun",
            "description_en": "The number of files downloaded via the Metric API during the specified period.",
            "description_ms": "Bilangan fail yang dimuat turun melalui API Metric dalam tempoh yang ditentukan."
        }
    ],
    "translations_en": {
        "date": "Date",
        "views": "Views",
        "api_hits": "API Hits",
        "downloads": "Downloads"
    },
    "translations_ms": {
        "date": "Tarikh",
        "views": "Tontonan",
        "api_hits": "Hits API",
        "downloads": "Muat Turun"
    },
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Metadata",
            "category_ms": "Metadata",
            "category_sort": 120,
            "subcategory_en": "Site Metrics",
            "subcategory_ms": "Metrik Portal",
            "subcategory_sort": 5
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ]
}