{
    "title_en": "Vehicle Registration Transactions: Cars",
    "title_ms": "Transaksi Pendaftaran Kenderaan: Kereta",
    "title_sort": 10,
    "description_en": "Car registration transactions from 2000 to the present. The table below provides a preview of the full dataset, which contains hundreds of thousands of transactions per year.",
    "description_ms": "Transaksi pendaftaran kereta dari 2000 sehingga kini. Jadual di bawah memberi pratonton kepada dataset penuh yang mengandungi beratus ribu transaksi bagi setiap tahun.",
    "exclude_openapi": true,
    "manual_trigger": "2025-10-10 18:00:45.211683",
    "data_as_of": "2025-09-30 23:59",
    "last_updated": "2025-10-10 08:42",
    "next_update": "2025-11-10 16:00",
    "methodology_en": "This dataset contains the actual transactional records of all cars registered with the Road Transport Department (JPJ) since 2000, excluding any personal identifiable data **(note: no personal data as defined by Act 709 is ever handled or even received by the data.gov.my team in the process of producing this dataset)**. Under Malaysian law, all vehicles must be registered with JPJ and be assigned a registration plate number before they can be used on the road.\n\nWhile there has been cleaning and validation conducted prior to publication, no other amendment or aggregation has been performed; each row in the dataset represents 1 registration transaction. This is the most granular form of the data, i.e. the single source of truth from which all other car registration statistics are derived, including those shown on data.gov.my.",
    "methodology_ms": "Set data ini mengandungi rekod transaksi sebenar semua kereta yang didaftarkan dengan Jabatan Pengangkutan Jalan sejak tahun 2000, tanpa sebarang data peribadi **(nota: tiada sebarang data peribadi mengikut definisi Akta 709 yang dikendalikan atau diterima oleh pasukan data.gov.my dalam proses menghasilkan set data ini)**. Di bawah undang-undang Malaysia, mana-mana kenderaan perlu didaftarkan dengan JPJ dan diberi nombor plat pendaftaran sebelum dapat digunakan di atas jalan.\n\nWalaupun proses pembersihan dan pengesahan telah dilaksanakan atas medan-medan dalam set data ini, tiada sebarang pindaan atau pengagregatan lain yang telah dilakukan; setiap baris dalam set data ini mewakili 1 transaksi pendaftaran. Ini adalah bentuk data yang paling terperinci, iaitu sumber rujukan tunggal yang digunakan untuk menghasilkan semua statistik pendaftaran kereta lain, termasuk yang dipaparkan di data.gov.my.",
    "caveat_en": "This dataset captures the registration of cars, not the sale or import or any other transaction. Therefore, if a car is not registered for use on the road, it will not be present in this dataset (e.g. cars which are purchased purely for private display).\n\nFurthermore, it should be noted that this dataset was extremely difficult to prepare, especially for data from the early 2000s when data collection systems were not as sophisticated as they are now. Accordingly, if you spot any errors in the dataset or have any suggestions to improve its quality, please write to data.dtsa@jdn.gov.my so the data.gov.my team can work with JPJ to fix or improve it as soon as possible.",
    "caveat_ms": "Set data ini menunjukkan pendaftaran kereta, bukannya penjualan atau import atau apa jua transaksi lain. Oleh itu, sekiranya sesebuah kereta tidak didaftarkan untuk digunakan di atas jalan, ia tidak akan terkandung dalam set data ini (contohnya kereta yang dibeli hanya untuk koleksi swasta).\n\nSelain itu, harus diingati bahawa set data ini amat rumit untuk disediakan, terutamanya bagi data dari awal 2000-an semasa sistem pengumpulan data tidak secanggih yang digunakan pada hari ini. Oleh itu, sekiranya anda mengesan apa sahaja ralat atau ingin cadangkan sebarang penambahbaikan, sila maklumkan pihak kami di data.dtsa@jdn.gov.my supaya kami susuli dengan secepat mungkin bersama JPJ.",
    "publication_en": "datagovmy features a [dashboard on car popularity and vehicle registrations](https://data.gov.my/dashboard/car-popularity), which enables you to explore this dataset in an interactive manner!",
    "publication_ms": "datagovmy membekalkan [_dashboard_ tentang populariti kereta dan pendaftaran kenderaan](https://data.gov.my/ms-MY/dashboard/car-popularity) yang membolehkan anda menerokai set data ini dengan interaktif!",
    "link_parquet": "https://storage.data.gov.my/transportation/cars_YYYY-MM-DD.parquet",
    "link_csv": "https://storage.data.gov.my/transportation/cars_YYYY-MM-DD.csv",
    "link_preview": "https://storage.data.gov.my/transportation/cars_preview.parquet",
    "link_editions": [
        "2025",
        "2024",
        "2023",
        "2022",
        "2021",
        "2020",
        "2019",
        "2018",
        "2017",
        "2016",
        "2015",
        "2014",
        "2013",
        "2012",
        "2011",
        "2010",
        "2009",
        "2008",
        "2007",
        "2006",
        "2005",
        "2004",
        "2003",
        "2002",
        "2001",
        "2000"
    ],
    "frequency": "DAILY",
    "geography": [
        "STATE"
    ],
    "demography": [],
    "dataset_begin": 2000,
    "dataset_end": 2025,
    "data_source": [
        "JPJ",
        "MOT"
    ],
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Transportation",
            "category_ms": "Pengangkutan",
            "category_sort": 41,
            "subcategory_en": "Vehicle Registrations",
            "subcategory_ms": "Pendaftaran Kenderaan",
            "subcategory_sort": 20
        }
    ],
    "fields": [
        {
            "name": "date_reg",
            "title_en": "Date of Registration",
            "title_ms": "Tarikh Pendaftaran",
            "description_en": "[Date] The date of registration of the vehicle in YYYY-MM-DD format; please note that this date may not be the same as the date of purchase",
            "description_ms": "[Tarikh] Tarikh pendaftaran kenderaan dalam format YYYY-MM-DD; sila ambil perhatian bahawa tarikh ini tidak semestinya sama dengan tarikh pembelian"
        },
        {
            "name": "type",
            "title_en": "Vehicle Type",
            "title_ms": "Jenis Kenderaan",
            "description_en": "[Categorical] One of 5 vehicle types classed under as Cars for the purpose of analysis, namely motorcars ('motokar'), MPVs ('motokar_pelbagai_utiliti'), jeeps ('jip'), pick-up trucks ('pick_up') and window vans ('window_van')",
            "description_ms": "[Kategori] Satu daripada 5 jenis kenderaan yang dikelaskan sebagai Kereta bagi tujuan analisis, iaitu motokar ('motokar'), motokar pelbagai utiliti ('motokar_pelbagai_utiliti'), jip ('jip'), trak pikap ('pick_up') dan van bertingkap ('window_van')"
        },
        {
            "name": "maker",
            "title_en": "Car Maker",
            "title_ms": "Jenama Kereta",
            "description_en": "[String] Maker of the vehicle (e.g. Perodua, Proton, Toyota) in upper-case text",
            "description_ms": "[Rentetan] Pembuat kereta (contohnya Perodua, Proton, Toyota) dalam teks huruf besar"
        },
        {
            "name": "model",
            "title_en": "Car Model",
            "title_ms": "Model Kereta",
            "description_en": "[String] Model of the vehicle (e.g. Bezza (Perodua), Saga (Proton), City (Honda)) in upper-case text",
            "description_ms": "[Rentetan] Model kereta (contohnya Bezza (Perodua), Saga (Proton), City (Honda)) dalam teks huruf besar"
        },
        {
            "name": "colour",
            "title_en": "Car Colour",
            "title_ms": "Warna Kereta",
            "description_en": "[String] Colour of the car in lower-case English text; please note these are broadly defined colours which do not distinguish between shades of the same colour (e.g. light blue and dark blue are both classed as blue)",
            "description_ms": "[Rentetan] Warna kereta dalam teks Bahasa Inggeris huruf kecil; sila ambil perhatian bahawa warna dalam set data ini dikelaskan secara kasar, bermaksud rona warna tidak dapat dibezakan (contohnya kedua-dua biru gelap dan biru muda dikelaskan sebagai biru)"
        },
        {
            "name": "fuel",
            "title_en": "Fuel",
            "title_ms": "Bahan Bakar",
            "description_en": "[String] Fuel used by the car's engine(s); there are 7 types, namely petrol ('petrol'), diesel ('diesel'), green diesel ('greendiesel'), natural gas ('ng'), liquefied natural gas ('lng'), hydrogen ('hydrogen'), and electricity ('electric'). Cars which can run on electricity or fuel are classed as hybrid (either 'hybrid_petrol' or 'hybrid_diesel'). Combinations of two fuels indicate that the car's engine can use more than one type of fuel; for instance, 'diesel_ng' means the car's engine can use both diesel and natural gas as fuel.",
            "description_ms": "[Rentetan] Bahan bakar yang diguna oleh enjin kereta tersebut; terdapat 7 jenis iaitu petrol ('petrol'), diesel ('diesel'), diesel hijau ('greendiesel'), gas asli ('ng'), gas asli cecair ('lng'), hidrogen ('hydrogen'), dan elektrik ( 'elektrik'). Kereta yang boleh menggunakan bateri elektrik atau bahan api dikelaskan sebagai hibrid (sama ada 'hybrid_petrol' atau 'hybrid_diesel'). Gabungan dua jenis bahan api bermaksud bahawa enjin kereta tersebut boleh menggunakan lebih daripada satu jenis bahan api; contohnya 'diesel_ng' bermaksud enjin kereta boleh menggunakan kedua-dua diesel dan gas asli sebagai bahan bakar."
        },
        {
            "name": "state",
            "title_en": "State of Registration",
            "title_ms": "Negeri Pendaftaran",
            "description_en": "[String] One of 16 states, or 'Rakan Niaga'; this either indicates the state of the JPJ office the car was registered at, or that the car was registered through an official JPJ partner portal ('Rakan Niaga'). Please note that this data field has no relation to the car's number plate, which may be freely chosen with no dependence on where the car was registered.",
            "description_ms": "[Rentetan] Satu daripada 16 negeri, atau 'Rakan Niaga'; ini sama ada merujuk kepada negeri pejabat JPJ di mana kereta tersebut didaftarkan, atau bahawa kereta tersebut didaftarkan melalui portal Rakan Niaga JPJ rasmi. Sila ambil perhatian bahawa medan ini langsung tidak berkaitan dengan nombor plat pendaftaran kereta, yang boleh dipilih secara bebas tanpa bergantung kepada lokasi pendaftaran kereta."
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": 0,
                "filter_columns": [],
                "freeze_columns": []
            }
        }
    ],
    "translations_en": {
        "date_reg": "Registration Date",
        "type": "Type",
        "maker": "Maker",
        "model": "Model",
        "colour": "Colour",
        "fuel": "Fuel Type",
        "state": "State"
    },
    "translations_ms": {
        "date_reg": "Tarikh Pendaftaran",
        "type": "Jenis",
        "maker": "Jenama",
        "model": "Model",
        "colour": "Warna",
        "fuel": "Bahan Bakar",
        "state": "Negeri"
    },
    "related_datasets": []
}