{
    "title_en": "Daily FPX Transactions",
    "title_ms": "Transaksi FPX Harian",
    "title_sort": 5,
    "description_en": "Daily volume and value of FPX transactions by business model.",
    "description_ms": "Jumlah dan nilai transaksi FPX harian mengikut model perniagaan.",
    "exclude_openapi": false,
    "manual_trigger": "1",
    "data_as_of": "2026-01-10 23:59",
    "last_updated": "2026-01-11 02:00",
    "next_update": "2026-01-12 02:00",
    "methodology_en": "This data is derived from transactional records of payments settled through the Financial Process Exchange (FPX) system operated by PayNet, Malaysia's national payments network and central financial infrastructure. FPX transactions are recorded in real time as they occur through the national payment gateway, where customers securely authorise payments from their bank accounts. Each transaction is captured centrally by PayNet's infrastructure.\n\nDaily aggregates are generated by summing the number of settled transactions (volume) and their total monetary value (in RM) for each date, segmented by business model. The types of business models are as follows:\n- Business-to-consumer (B2C): Payments initiated from individual/retail customer accounts, typically for e-commerce purchases, or consumer services.\n- Business-to-business (B2B): Payments initiated from corporate/business accounts, typically higher-value transactions between businesses.\n\nFor the purpose of publication via data.gov.my, PayNet conducts the aggregation and provides only the daily totals; no transaction-level data is ever disseminated outside PayNet's systems.",
    "methodology_ms": "Data ini dihasilkan daripada rekod transaksi pembayaran yang telah diselesaikan melalui sistem _Financial Process Exchange_ (FPX) yang dikendalikan oleh PayNet, rangkaian pembayaran dan infrastruktur kewangan berpusat nasional Malaysia. Transaksi FPX direkod secara masa nyata (_real time_) semasa ia berlaku melalui gerbang pembayaran nasional, di mana pelanggan mengesahkan pembayaran secara selamat daripada akaun bank mereka. Setiap transaksi disimpan secara berpusat oleh PayNet.\n\nAgregat harian dijana dengan menjumlahkan bilangan transaksi yang diselesaikan (_volume_) serta jumlah nilai monetarinya (dalam RM) bagi setiap tarikh, dengan pecahan mengikut model perniagaan. Jenis model perniagaan adalah seperti berikut:\n- Perniagaan-ke-pengguna (B2C): Pembayaran yang dimulakan daripada akaun pelanggan individu/runcit, biasanya untuk pembelian e-dagang atau perkhidmatan pengguna.\n- Perniagaan-ke-perniagaan (B2B): Pembayaran yang dimulakan daripada akaun korporat/perniagaan, biasanya transaksi bernilai tinggi antara perniagaan.\n\nBagi tujuan penerbitan melalui data.gov.my, pihak Paynet yang melaksanakan proses penjumlahan dan seterusnya menyalurkan agregat harian sahaja; tiada data peringkat transaksi yang disebarkan di luar sistem PayNet.",
    "caveat_en": "This dataset is provided with the highest practical timeliness (updated by 2am daily for data up to the previous day) due to its high potential for use in nowcasting and forecasting models. However, there may occasional revisions to ensure eventual consistency with the monthly payment statistics published by the Central Bank of Malaysia (BNM). Furthermore, users should note that data for 2024-11-24 is missing at this time; this will be rectified by 1 March 2026.",
    "caveat_ms": "Set data ini dibekalkan dengan kepantasan yang tertinggi (dikemas kini pada pukul 2 pagi secara harian dengan data sehingga hari sebelumnya) kerana potensinya yang tinggi untuk digunakan dalam model _nowcasting_ dan _forecasting_. Walau bagaimanapun, set data ini mungkin disemak dari semasa ke semasa untuk memastikan ia selaras dengan statistik pembayaran bulanan yang diterbitkan oleh Bank Negara Malaysia (BNM). Selain itu, pengguna perlu ambil perhatian bahawa data untuk 2024-11-24 tidak tersedia pada masa ini; isu ini akan diselesaikan sebelum 1 Mac 2026.",
    "publication_en": "N/A",
    "publication_ms": "N/A",
    "link_parquet": "https://storage.data.gov.my/finsector/payments/trnsc_daily_fpx.parquet",
    "link_csv": "https://storage.data.gov.my/finsector/payments/trnsc_daily_fpx.csv",
    "frequency": "DAILY",
    "geography": [
        "NATIONAL"
    ],
    "demography": [],
    "dataset_begin": 2020,
    "dataset_end": 2026,
    "data_source": [
        "PayNet",
        "BNM"
    ],
    "site_category": [
        {
            "site": "datagovmy",
            "category_en": "Financial Markets",
            "category_ms": "Pasaran Kewangan",
            "category_sort": 60,
            "subcategory_en": "Payments",
            "subcategory_ms": "Pembayaran",
            "subcategory_sort": 25
        }
    ],
    "fields": [
        {
            "name": "date",
            "title_en": "Date",
            "title_ms": "Tarikh",
            "description_en": "[Date] The date in YYYY-MM-DD format",
            "description_ms": "[Tarikh] Tarikh dalam format YYYY-MM-DD"
        },
        {
            "name": "model",
            "title_en": "Business Model",
            "title_ms": "Model Perniagaan",
            "description_en": "[String] The type of FPX business model, either all models ('all'), business-to-business ('B2B') or business-to-consumer ('B2C').",
            "description_ms": "[Rentetan] Jenis model perniagaan FPX, sama ada semua model ('all'), perniagaan-ke-perniagaan ('B2B') atau perniagaan-ke-pengguna ('B2C')."
        },
        {
            "name": "volume",
            "title_en": "Transaction Volume",
            "title_ms": "Bilangan Transaksi",
            "description_en": "[Integer] Number of FPX transactions for the date and model.",
            "description_ms": "[Integer] Jumlah transaksi FPX untuk tarikh dan model."
        },
        {
            "name": "value",
            "title_en": "Transaction Value (RM)",
            "title_ms": "Nilai Transaksi (RM)",
            "description_en": "[Float, RM] Value of FPX transactions for the date and model in Ringgit Malaysia (RM).",
            "description_ms": "[Apung, RM] Nilai transaksi FPX untuk tarikh dan model, dalam Ringgit Malaysia (RM)."
        }
    ],
    "dataviz": [
        {
            "dataviz_id": "table",
            "title_en": "Table",
            "title_ms": "Jadual",
            "chart_type": "TABLE",
            "config": {
                "precision": {
                    "default": 0,
                    "columns": {
                        "volume": 0,
                        "value": 2
                    }
                },
                "filter_columns": [
                    "model"
                ],
                "freeze_columns": [
                    "date"
                ]
            }
        },
        {
            "dataviz_id": "Volume",
            "title_en": "Transaction Volume",
            "title_ms": "Bilangan Transaksi",
            "chart_type": "TIMESERIES",
            "config": {
                "filter_columns": [
                    "model"
                ],
                "precision": 0,
                "operation": "SUM",
                "format": {
                    "x": "date",
                    "y": [
                        "volume"
                    ]
                }
            }
        },
        {
            "dataviz_id": "Value",
            "title_en": "Transaction Value",
            "title_ms": "Nilai Transaksi",
            "chart_type": "TIMESERIES",
            "config": {
                "filter_columns": [
                    "model"
                ],
                "precision": 0,
                "operation": "SUM",
                "format": {
                    "x": "date",
                    "y": [
                        "value"
                    ]
                }
            }
        }
    ],
    "translations_en": {
        "date": "Date",
        "model": "Business Model",
        "volume": "Volume",
        "value": "Value (RM)",
        "both": "All Models",
        "b2b": "Business-to-Business (B2B)",
        "b2c": "Business-to-Consumer (B2C)",
        "x": "Date",
        "y1": "Value"
    },
    "translations_ms": {
        "date": "Tarikh",
        "model": "Model Perniagaan",
        "volume": "Bilangan",
        "value": "Nilai (RM)",
        "both": "Semua Model",
        "b2b": "Perniagaan-ke-Perniagaan (B2B)",
        "b2c": "Perniagaan-ke-Pengguna (B2C)",
        "x": "Tarikh",
        "y1": "Nilai"
    },
    "related_datasets": []
}